Revit 2027 API
AnalysisDisplayVectorSettings.VectorTextType Property
 Type of vector text visualization.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleVectorTextType VectorTextType { get; set; }
Public Property VectorTextType As AnalysisDisplayStyleVectorTextType
	Get
	Set
public:
property AnalysisDisplayStyleVectorTextType VectorTextType {
	AnalysisDisplayStyleVectorTextType get ();
	void set (AnalysisDisplayStyleVectorTextType value);
}
member VectorTextType : AnalysisDisplayStyleVectorTextType with get, set
Property Value
AnalysisDisplayStyleVectorTextType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace